"""
Модуль для конвертації температури між шкалами Цельсія та Кельвіна.
"""


def celsius_to_kelvin(c):
    """
    Переводить температуру з Цельсія у Кельвін.

    Args:
        c: Температура в градусах Цельсія.

    Returns:
        Температура в Кельвінах.
    """
    return c + 273.15


def kelvin_to_celsius(k):
    """
    Переводить температуру з Кельвіна у Цельсій.

    Args:
        k: Температура в Кельвінах.

    Returns:
        Температура в градусах Цельсія.
    """
    return k - 273.15